{
    "title": "How to Repair a Chest Freezer that Leaks",
    "author": "Written byChris Nicksonon Apr 06, 2010",
    "additional_text_boxes": [],
    "supplies": [
        "Wire hanger",
        "Drain pan"
    ],
    "steps": [
        [
            "Step 1 - Unblock the Drain Tube",
            "If afreezer still freezes, the usual cause of a leak is the drain tube has become blocked. This is the component through which water from the freezer usually runs out. When this happens, the water will usually find another way out which ultimately causes the leak. The first thing you need to do is to locate the drain tube. It will generally be at the back of the freezer and is made of plastic. You might have to remove the back panel in order to access it. Rub the tube and see if it feels tight or bloated."
        ],
        [
            "Step 2 - Clean out the Tube",
            "Take a wire hanger and straighten it out. Try to push the wire up the tube. If it meets resistance, the tube is definitely clogged. You can try and use the hanger to poke the clog out of the tube although you might not be successful if you are working from the bottom upward. Keep a drain pan under the tube to catch any debris and liquid you manage to push out from the drain tube."
        ],
        [
            "Step 3 - Empty the Freezer",
            "If pushing from the outside doesn’t work, you’re going to need to empty the freezer.Unplug the chest freezerand remove all the food inside. Try storing it in the bath with a towel over it. If you have items that can easily defrost, such as ice cream, put it in another freezer to keep properly cold. As you remove the items, check to see if the drain hole within the freezer has become blocked by an item of food from inside the freezer. This might be the ultimate cause. With the freezer empty, locate the drain hole at the bottom and try pushing through with your wire hanger. This should remove most, if not all, of the clog. Keep going until you’ve removed as much of the clog as possible."
        ],
        [
            "Step 4 - Defrost the Freezer",
            "If there’s a layer of ice at the bottom of the freezer, you’re going to need to completely defrost the freezer before you fill it again. In this instance, make sure you store the frozen food in other freezers or cook it so it doesn’t go to waste. Allow a good 24 hours for a complete defrost. You might need to empty the drain pan a couple of times during this period. Wipe out the inside of the chest freezer after it’s defrosted to remove any water. As you replace the food, ensure there’s a small, clear area around the drain hole inside the freezer. Plug the freezer back in and give it time to cool properly before replacing the food. Keep checking for leaks from the chest freezer for a day or so."
        ]
    ],
    "image_urls": [
        "https://cimg2.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/486/frozen-food-243486.jpg"
    ],
    "url": "https://www.doityourself.com/stry/how-to-repair-a-chest-freezer-that-leaks"
}