{
    "title": "How to Install a Chest Freezer",
    "author": "Written byJessica Tesorieroon Jul 13, 2009",
    "content": "",
    "supplies": [],
    "steps": [
        [
            "Step 1 - Select a Freezer",
            "Select the freezerthat meets your needs. Remember the best freezer for you will be one which fits in the space you have, runs economically, and falls within your budget. Also, remember a 220V home freezer will usually run more economically than a 110V one."
        ],
        [
            "Step 2 - Determine Your Wire, Circuit Breaker, and Outlet Needs",
            "If the freezer runs on 110V then you will need 12X2 electrical wiring and a 110V outlet. If it uses 220V, then you will need 12X3 electrical wiring and a 220V outlet. You will need a circuit breaker which supports the number of amps you will be drawing for your freezer. In most cases, if it is a 220V you will want a 30-amp breaker. A 110V will usually require a 15 or 20 amp breaker. This information can be found in the manual supplied with the freezer."
        ],
        [
            "Step 3 - Select the Location",
            "Measure the width, depth, and height of your chest freezer. When measuring it, make sure you measure the height with the lid fully open. Pick a location in your home where you would like to install the chest freezer. Measure the location to ensure a good fit."
        ],
        [
            "Step 4 - Cut Out the Drywall",
            "Place the cut-in electrical box against the wall and trace on the inside. Cut this out using your saw. Make sure the cut-in box fits in the hole snugly. If necessary, trim the hole out until the box fits."
        ],
        [
            "Step 5 - Turn off the Power",
            "Turn off the main breaker to the house. This will cut power to the circuit breaker panel."
        ],
        [
            "Step 6 - Run the Wire",
            "Run the wire from the circuit panel to the hole you are going to be installing the outlet in. It may be necessary to use a drill and a 1-inch paddle bit to drill a hole in the correct stud bay. This can be done from the attic or basement. Leave the wire hanging out of this hole."
        ],
        [
            "Step 7 - Install the Circuit Breaker",
            "Connect the copper wire to the ground port, the black wire to the neutral port and the white wire to the hot port. Snap the circuit breaker into place. If you are installing a 220V outlet and breaker, the red wire will connect to the secondary hot port. This provides two 110V poles."
        ],
        [
            "Step 8 - Install the Outlet",
            "If you are installing a 110V then the black is hot, white is neutral, and copper is ground. The ground screw is green, the silver screw is neutral, and the copper screw is hot. If you are dealing with a 220V receptacle then there will be two copper screws. Connect the red and white wires to these."
        ],
        [
            "Step 9 - Test the Outlet",
            "Turn the breaker panel back on and turn on the new breaker. Test the outlet using a voltmeter. You should receive either 110V or 220V. If you are using a 220V outlet and you are only receiving 110V, one of the hot wires is not connected."
        ],
        [
            "Step 10 - Install the Freezer",
            "Place the freezer in the location which you have selected and plug it in. Test it to verify it is working properly."
        ]
    ],
    "image_urls": [
        "https://cimg2.ibsrv.net/cimg/www.doityourself.com/660x300_85-1/486/frozen-food-243486.jpg"
    ],
    "url": "https://www.doityourself.com/stry/installing-a-chest-freezer"
}