{
    "title": "How to Clean Chest Freezer Condenser Coils",
    "author": "Written byZirkon Kaltion Apr 06, 2010",
    "additional_text_boxes": [],
    "supplies": [
        "Replacement condenser coil",
        "Screwdrivers",
        "Torchlight",
        "Vacuum cleaner",
        "Brush",
        "Clean cloth"
    ],
    "steps": [
        [
            "Step 1 - Disconnect all Plugs",
            "First, it is necessary to unplug the freezer or turn off the circuit breaker. Once the circuit breaker is off, you can slide the freezer away to unplug it from the wall outlet. If the freezer has an ice maker, turn off the water supply lines."
        ],
        [
            "Step 2 - Locate the Condenser Coils",
            "In older freezers, thecondenser coilruns up and down at the back. The coil is often painted black and resembles a grid-like structure. In modern freezers, the condenser coil is located underneath. There is a face that is directed at the condenser coil to help cool down the heat. Use a torchlight to locate the coil and fan. If the condenser coil is located behind the toe space panel, you will have to remove the panel and condensate tray to reveal the flat condenser coil. If the condenser coil is on the rear access panel, slide the freezer away and remove the screws that hold the panels to reveal the cylindrical condenser coil."
        ],
        [
            "Step 3 - Vacuum the Dirt and Dust",
            "Use a vacuum cleaner to clean away the dirt and dust on the condenser coil. When cleaning, make sure not to damage the coil. If the coil is accidentally broken, the refrigerant will escape, which can be costly to repair."
        ],
        [
            "Step 4 - Vacuum the Freezer Fan",
            "If the freezer fan is accessible, vacuum it to help move the air across the condenser coil. The dirt and dust that accumulate on the fan can hinder the airflow and damage the compressor."
        ],
        [
            "Step 5 - Remove the Remaining Dust with a Brush",
            "If there is still any remaining dust on the coil and fan, gently brush it away with a paintbrush. The condenser coil should be cleaned at least two times per year. Before cleaning the freezer, always remember to unplug the power supply."
        ]
    ],
    "image_urls": [
        "https://cimg1.ibsrv.net/cimg/www.doityourself.com/660x550_85/437/AdobeStock_84907996-426437.png",
        "https://cimg1.ibsrv.net/cimg/www.doityourself.com/660x440_85/817/deep-freezer-166817.jpg"
    ],
    "url": "https://www.doityourself.com/stry/how-to-clean-chest-freezer-condenser-coils"
}