{
    "title": "How to Defrost an Upright Freezer",
    "author": "Written byChevy Bhorntuson Oct 27, 2010",
    "additional_text_boxes": [],
    "supplies": [
        "Aluminum cookie sheets",
        "Plastic spatula",
        "Towels",
        "Duct tape",
        "Plastic garbage bags",
        "Ice chests or coolers",
        "Ice packs"
    ],
    "steps": [
        [
            "Step 1 – Prepare the Upright Freezer",
            "You need to unplug the upright freezer and empty its contents prior to defrosting the freezer. The items you remove from the freezer will probably not defrost in the time you are working on the freezer, but boxes can get soggy and fall apart, effectively ruining the item. To prevent this from happening, place them all in a cooler with ice packs. You also want to remove shelves, baskets or any other small storage compartments in the upright freezer."
        ],
        [
            "Step 2 – Defrost the Upright Freezer",
            "Take a towel and place it at the bottom of the freezer. You may use more than one to cover the bottom and you may also fold them so that they fit. This all depends on the size of the upright freezer. On top of the towel, place an aluminum cookie sheet. If there is room in the freezer, place two or more, as long as they fit side by side. The goal here is to cover as much of the bottom of the freezer as possible. The cookie sheets will catch drips of water as the towels will catch any overflow. The aluminum will also help prevent the water from refreezing."
        ],
        [
            "Step 3 – Add a Garbage Bag",
            "Since thedoor of the upright freezerhas to be open for it to defrost, water can leak out. This can be kept to a minimum by making use of a garbage bag. Fan the garbage bag out so it does not cling to itself. With the bag spread open, place one side barely inside the freezer and tape it down. Pull the bag open andtape it to the doorso that the bag remains open and hanging from the freezer. Use duct tape, because it creates a strong seal and water will not cause it to come loose."
        ],
        [
            "Step 4 – Remove Excess Ice",
            "If you want to speed up the process, you can remove the frost from the inside of the freezer. Use a plastic spatula to scrape it from the sides. The frost will fall to the cookie sheet. Take the sheet and dispose of the ice in the sink. The towel will catch any drips until you come back to replace the pan. Never force the ice. Start with the sides of the upright freezer working your way up. When done, remove the cookie sheets, towel, and bag. Wipe down the freezer and replace everything. You can now plug the freezer back in. Follow these steps to defrost your freezer in no time. Defrosting the freezer makes your fan's job a little easier and prevents over freezing."
        ]
    ],
    "image_urls": [
        "https://cimg0.ibsrv.net/cimg/www.doityourself.com/660x300_85/460/adobestock-71565447-630460.jpg"
    ],
    "url": "https://www.doityourself.com/stry/how-to-defrost-an-upright-freezer"
}